[
    {
        "title": "Deception VS. Persuasion",
        "year": "2025",
        "image": "../images/Project2.png",
        "description": "A project to design two visualization to persuade audience to believe both truth, when only one truth exist. Here, the actual truth shows that increase female enrollment to tertiary school, gradually cause a population growth decline."
    },
    {
        "title": "Nutrition ",
        "year": "2025",
        "image": "../images/Project1.png",
        "description": "Visualization design to show how one type of food, listed as baby food, have extremely odd nutrition values amongst other baby food."
    },
    {
        "title": "Factors To Depression",
        "year": "2025",
        "image": "../images/cogs108.png",
        "description": "Research project to show which factor contributes most to a student's deteriorating mental health."
    },
    {
        "title": "Cooking Time VS. Ratings",
        "year": "2025",
        "image": "../images/dsc80.png",
        "description": "Research regarding whether slower cooking time correlates to higher recipe ratings, due to the fact that some people might have busier schedule so they can't afford to cook for long."
    },
    {
        "title": "BST Interactive Visualizer",
        "year": "2024",
        "image": "../images/bst.jpg",
        "description": "Visualization project to display what the BST tree algorithm is like with functions like insert and remove. This was made with C++ and SFML."
    },
    {
        "title": "Graph Interactive Visualizer",
        "year": "2024",
        "image": "../images/graph.jpg",
        "description": "Visualization project to display what the graph algorithm is like with functions to add vertex or make edits to graph edges. This was made with C++ and SFML."
    },
    {
        "title": "Hash Table Interactive Visualizer",
        "year": "2024",
        "image": "../images/hash_table.jpg",
        "description": "Visualization project to display hash table algorithm with remove and insert functions. This was made with C++ and SFML."
    },
    {
        "title": "Linked List Interactive Animation Visualizer",
        "year": "2024",
        "image": "../images/linked_list.jpg",
        "description": "Animation project to display doubly linked list algorithm with various insert and remove node. This was made with C++ and SFML."
    },
    {
        "title": "Mergesort Animation",
        "year": "2024",
        "image": "../images/mergesort.jpg",
        "description": "Animation project to display the way a mergesort algorithm work. This was made with C++ and SFML."
    },
    {
        "title": "Quicksort Animation",
        "year": "2024",
        "image": "../images/quicksort.jpg",
        "description": "Animation project to display the way a quicksort algorithm work. This was made with C++ and SFML."
    },
    {
        "title": "Advocating For Ocean Cleaning",
        "year": "2021",
        "image": "../images/girlswhocode.jpg",
        "description": "First HTML, CSS, and JavaScript project with GirlsWhoCode summer immersion program focused on cleanup ."
    },
    {
        "title": "Repudiandae esse eaque at.",
        "year": "2021",
        "image": "https://dsc106.com/labs/lab02/images/empty.svg",
        "description": "Dicta numquam incidunt dolorem vel exercitationem officiis, pariatur voluptates vero architecto, laudantium hic quaerat expedita quod deserunt ad! Sunt, veniam numquam cumque quisquam ipsa id voluptatem praesentium ducimus excepturi reprehenderit?"
    }
]